tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "wata727/tflint"

brew "ack"
brew "adr-tools"
brew "openssl"
# brew "awscli"
brew "bash"
brew "curl"
brew "kubectl"
brew "direnv"
brew "docker", link: false
brew "git"
brew "gnu-sed"
brew "gnupg"
# brew "imagemagick"
brew "libpq"
brew "node"
brew "nodenv"
brew "openconnect"
brew "openssh"
brew "pinentry-mac"
# brew "postgresql"
brew "rbenv"
brew "ruby-build"
# brew "redis", restart_service: true
brew "shellcheck"
brew "tilt"
brew "tfenv"
brew "tflint"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "whois"
brew "yq"
brew "zsh"
brew "stats"
brew "git-absorb"

brew "kotlin"
brew "openjdk@17"

brew "go"
brew "goenv"

# Window manager
brew "loop"

cask "wezterm"
cask "tuple"
# cask "karabiner-elements"
