tap "jandeobbleleer/oh-my-posh"
tap "FelixKratz/formulae"
tap "nikitabobko/aerospace"

brew "ack"
brew "adr-tools"
brew "openssl"
# brew "awscli"
brew "bash"
brew "colima"
brew "curl"
brew "kubectl"
brew "kubernetes-cli"
brew "direnv"
brew "docker", link: false
brew "git"
brew "git-absorb"
brew "gnu-sed"
brew "gnupg"
brew "jq"
# brew "imagemagick"
brew "libpq"
brew "openconnect"
brew "openssh"
brew "pinentry-mac"
# brew "postgresql"
# brew "redis", restart_service: true
brew "shellcheck"
# brew "stats"
brew "sqlfluff"
brew "tilt"
# brew "terraform"
brew "tfenv"
brew "tmux"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "whois"
brew "yq"
brew "zsh"

# Kotlin
# brew "kotlin"
# brew "openjdk@17"

# Go
brew "go"
brew "goenv"
brew "golangci-lint"

# Python
brew "pyenv"

# Ruby
brew "rbenv"
brew "ruby-build"

# Node
brew "node"
brew "nodenv"

brew "borders"

# CLI timer
brew "caarlos0/tap/timer"
brew "terminal-notifier"

brew "oh-my-posh"
cask "jandeobbleleer/oh-my-posh/oh-my-posh"
cask "nikitabobko/tap/aerospace"

# Fonts
cask "font-jetbrains-mono-nerd-font"

cask "firefox"
cask "ghostty"
cask "github"
cask "postman"
cask "slack"
cask "tuple"
cask "visual-studio-code"
# cask "wezterm"
# cask "karabiner-elements"
